
{
	"name": "Ariel Vernaza",
	"jobTitle": "Senior Software Engineer",
	"summary": "I'm Ariel Vernaza, a Senior Full Stack Developer based in Panama City, Panama. My expertise lies in Python, C++, Ruby on Rails, React, React Native, Postgres, Kubernetes, and GraphQL. I have a strong background in backend development, AI integration, and optimizing system performance. With a Master's in Game Design and Computer Science specializing in Artificial Intelligence, I bring extensive experience across various programming languages (Python, C++, Ruby, Java, etc.), frameworks (Django, Rails, Next.js, React, etc.), AI tools (TensorFlow, Keras, PyTorch, etc.), and backend technologies (Kubernetes, Docker, AWS, etc.). I'm passionate about designing robust software solutions, developing AI systems, and engaging in technical design. In my free time, I enjoy swimming, practicing kendo, and playing action RPG fantasy games.",
	"experience": [
		{
			"position": "Teach Lead",
			"company": "LazyRacoon LLC",
			"startDate": "July 2024",
			"endDate": "present",
			"description": "At LazyRacoon, I've been working as a Teach Lead, specializing in Next.js, React, MySQL, and NLP (Natural Language Processing). My role involves building backend and database integrations for marketplace and cart flow systems, as well as designing and implementing NLP solutions integrated with product workflows."
		},
		{
			"position": "Senior Software Engineer Fullstack",
			"company": "Transfix LLC",
			"startDate": "October 2022",
			"endDate": "July 2024",
			"description": "At Transfix, I worked as a Senior Software Engineer Fullstack, utilizing Ruby on Rails, React, React Native, Postgres, Kubernetes, and GraphQL. My primary responsibilities included developing the Transfix Mobile App and integrating React Native for cross-platform functionality."
		},
		{
			"position": "Senior Software Engineer",
			"company": "Adelantos S.A. (Adquired by PayJoy)",
			"startDate": "October 2021",
			"endDate": "October 2022",
			"description": "At Adelantos, I served as a Senior Software Engineer, specializing in Python, Django, GraphQL, Postgres, and Kubernetes. My role focused on designing and implementing integrations with payment providers and banking systems across multiple countries, as well as developing data mining solutions to enhance market reach"
		}
	],
	"education": [
		{
			"institution": "Peder skrivare skola",
			"degree": "Media Teknik",
			"startDate": "August 2012",
			"endDate": "May 2016"
		},
    {
			"institution": "Peder skrivare skola",
			"degree": "Processteknik",
			"startDate": "August 2016",
			"endDate": "May 2017"
		},
    {
			"institution": "Campus Varberg",
			"degree": "Systemutvecklare.NET",
			"startDate": "August 2022",
			"endDate": "Present"
		}
    
	],
	"skills": [
		"HTML",
		"CSS",
		"JavaScript",
		"C#",
    	"SQL"
	]
}